package com.example.recipebook.model

val sampleRecipes = listOf(
    Recipe(1,"Паста","Итальянская паста","Сварить пасту и добавить соус",
        listOf("Паста","Соус","Сыр"),"Итальянская",20,"Легко",RecipeState.WANT_TO_COOK),

    Recipe(2,"Бургер","Сочный бургер","Обжарить котлету и собрать бургер",
        listOf("Булка","Мясо","Сыр"),"Фастфуд",30,"Средне",RecipeState.COOKING),

    Recipe(3,"Салат","Овощной салат","Нарезать и перемешать",
        listOf("Огурец","Помидор"),"Здоровое",10,"Легко",RecipeState.COOKED),

    Recipe(4,"Пицца","Домашняя пицца","Раскатать тесто и запечь",
        listOf("Тесто","Сыр"),"Итальянская",25,"Средне",RecipeState.WANT_TO_COOK),

    Recipe(5,"Суп","Куриный суп","Варить курицу",
        listOf("Курица","Овощи"),"Домашняя",40,"Легко",RecipeState.ON_HOLD),

    Recipe(6,"Стейк","Говяжий стейк","Обжарить мясо",
        listOf("Говядина"),"Мясо",15,"Сложно",RecipeState.COOKING),

    Recipe(7,"Блины","Тонкие блины","Жарить тесто",
        listOf("Мука","Молоко"),"Домашняя",20,"Легко",RecipeState.COOKED),

    Recipe(8,"Рис","Отварной рис","Сварить рис",
        listOf("Рис","Вода"),"Гарнир",15,"Легко",RecipeState.ABANDONED),

    Recipe(9,"Омлет","Яичный омлет","Пожарить яйца",
        listOf("Яйца"),"Завтрак",10,"Легко",RecipeState.WANT_TO_COOK),

    Recipe(10,"Торт","Шоколадный торт","Испечь и собрать",
        listOf("Мука","Какао"),"Десерт",60,"Сложно",RecipeState.ON_HOLD)
)